#Vanused
# Создание списка возрастов
возраста = [25, 30, 35, 40, 45, 50]
# Нахождение наибольшего и наименьшего числа
макс_возраст = max(возраста)
мин_возраст = min(возраста)
# Нахождение общего числа и среднего значения
общий_возраст = sum(возраста)
средний_возраст = общий_возраст / len(возраста)
# Вывод результатов
print("Макс возраст: ", макс_возраст)
print("Мин. возраст: ", мин_возраст)
print("Общий возраст: ", общий_возраст)
print("Средний возраст: ", средний_возраст)
print()
input("Vajutage Enter...")
print()

